{
    "creationSource": null,
    "description": "",
    "name": "App and Browser Isolation",
    "platforms": "windows10",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 2,
    "technologies": "mdm",
    "id": "4730c8b3-bf2d-4591-ab40-ffe446e1b5f6",
    "templateReference": {
        "templateId": "9f667e40-8f3c-4f88-80d8-457f16906315_1",
        "templateFamily": "endpointSecurityAttackSurfaceReduction",
        "templateDisplayName": "App and Browser Isolation",
        "templateDisplayVersion": "Version 1"
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "1f2529c7-4b06-4ae6-bebc-210f7135676f"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowwindowsdefenderapplicationguard_3",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "4bacad31-1b46-4313-b4f7-5a1df8336d34",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowpersistence",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "860e664e-d9d2-4c3f-8ff5-558bf7fe8671"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowpersistence_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "b954f12e-054a-42ab-91f5-167330a65371",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowvirtualgpu",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "ae474d7e-2254-414b-a0c2-80424122951a"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowvirtualgpu_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "adcadd99-6392-4b7a-83b7-a32b468ed2a4",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowcameramicrophoneredirection",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "b46efb18-38f6-452b-a39e-6e8dc2a1ab27"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_allowcameramicrophoneredirection_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "81407db1-91b1-40e9-bec8-f074b9cff3a1",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardfiletype",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "a228edbe-28fa-4661-999d-bffc1dc894a7"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardfiletype_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "1c8026cc-dcf5-4515-a689-fe088ce7cffe",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardsettings",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "d7113126-8c43-45fb-8551-cc4b60d0bce0"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_clipboardsettings_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "0ff23474-d77c-409b-aaad-ad63e8a87fb1",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_settings_savefilestohost",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "ed78e634-a721-4bee-b3dc-2eda00fb55e7"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_settings_savefilestohost_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "c3bad48e-14c4-459a-ac52-0ccfcaa02d8d",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        },
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "cef26ac4-1a37-4b72-aca1-bca8076a2868"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_windowsdefenderapplicationguard_installwindowsdefenderapplicationguard_install",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7357acb4-6c1c-471a-a8db-d2f4439f3a54",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_windowsdefenderapplicationguard_audit_auditapplicationguard",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "1afb3b79-f47e-49bb-b054-34aa47c92075"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_windowsdefenderapplicationguard_audit_auditapplicationguard_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "9942e985-b6a4-4e1b-89e7-36757a66ba70",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        }
    ]
}